app/controllers/parks_controller.rb

SELECT * FROM "parks"
---
  def index
    @parks = Park.all

SELECT * FROM "parks" WHERE ("parks"."id" = 1)
---
  def show
    @park = Park.find(params[:id])

INSERT INTO "parks" ("name", "latitude", "created_at", "image_url", "site_url", "updated_at", "longitude", "description") VALUES('North Cascades National Park', 48.77134, '2010-06-30 05:57:02', '', '', '2010-06-30 05:57:02', -121.30028, 'This park is huge.')
---
  def create
    @park = Park.new(params[:park])

    respond_to do |format|
      if @park.save

SELECT * FROM "parks" WHERE ("parks"."id" = 16)
DELETE FROM "parks" WHERE "id" = 16
---
  def destroy
    @park = Park.find(params[:id])
    @park.destroy